In [1]:
#you will be using the Sakila database of movie rentals
#Create a query or queries to extract the information you think may be relevant for building the prediction model. It should include some film features and some rental features (X).
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine, text

In [2]:
from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

c:\Users\Lenovo\anaconda3\lib\site-packages\scipy\__init__.py:155: UserWarning: A NumPy version >=1.18.5 and <1.25.0 is required for this version of SciPy (detected version 1.26.0
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [3]:
#get password to connect to sql
password = getpass.getpass()

Create a query to get the list of all unique film titles and a boolean indicating if it was rented (rental_date) in May 2005.
 (Create new column called - 'rented_in_may'). This will be our TARGET (y) variable.

In [5]:
#'mysql+pymysql://database_user:'+password+'@ip/database_name'
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

#select data from actor and film tables
film= pd.read_sql_query('SELECT * FROM film', engine)
actor= pd.read_sql_query('SELECT * FROM actor', engine)
rental = pd.read_sql_query('SELECT * FROM rental', engine)
display(film.head())
display(actor.head())
display(rental.head())

query = query = '''
    SELECT
      DISTINCT(title), release_year,length, rating, special_features, language_id,
      CASE
        WHEN EXISTS (
          SELECT 1
          FROM rental
          INNER JOIN inventory ON rental.inventory_id = inventory.inventory_id
          WHERE inventory.film_id = film.film_id
          AND MONTH(rental_date) = 5
          AND YEAR(rental_date) = 2005
        ) THEN TRUE
        ELSE FALSE
      END AS rented_in_may
    FROM film;
'''

data = pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
data.shape

(1000, 7)

In [7]:
data.head()

,title,release_year,length,rating,special_features,language_id,rented_in_may
0,ACADEMY DINOSAUR,2006,86,PG,"Deleted Scenes,Behind the Scenes",1,1
1,ACE GOLDFINGER,2006,48,G,"Trailers,Deleted Scenes",1,0
2,ADAPTATION HOLES,2006,50,NC-17,"Trailers,Deleted Scenes",1,1
3,AFFAIR PREJUDICE,2006,117,G,"Commentaries,Behind the Scenes",1,1
4,AFRICAN EGG,2006,130,G,Deleted Scenes,1,1

In [8]:
data.dtypes

title               object
release_year         int64
length               int64
rating              object
special_features    object
language_id          int64
rented_in_may        int64
dtype: object

In [9]:
#cast rented_in_may to boolean
data['rented_in_may'] = data['rented_in_may'].astype(bool)

Analyze extracted features (X) and transform them. You may need to encode some categorical variables, or scale numerical variables.

In [11]:
X= data.drop(columns=['rented_in_may','title'])
y= data['rented_in_may']

In [12]:
#encode categorical variables
#get unique values for each column
for col in X.columns:
    print(col, X[col].unique())

release_year [2006]
length [ 86  48  50 117 130 169  62  54 114  63 126 136 150  94  46 180  82  57
 113  79 129  85  92 181  74 179  91 168 119 153 147 127 121  68  99 148
 137 170  83 108 118 162 182  75 173  87  65  90 122 160  89 175 106  73
 151 100  53  77 142  93 163 103  61  71 102  76  98  72 176 123  56 161
  60 133 125  67  52 120 167  70 135 112 183 110 152  51 146  66 185 124
 107 101 132 143 165  81 164  58  95 139  55 149 109  59 172 115 184 166
  64 104  69  84 144  88 141  47  49 177 154 159 178  96 116 171 140 155
 158 174 138  97 131 156  80 145 111 128 157  78 105 134]
rating ['PG' 'G' 'NC-17' 'PG-13' 'R']
special_features ['Deleted Scenes,Behind the Scenes' 'Trailers,Deleted Scenes'
 'Commentaries,Behind the Scenes' 'Deleted Scenes' 'Trailers'
 'Commentaries,Deleted Scenes' 'Trailers,Deleted Scenes,Behind the Scenes'
 'Trailers,Commentaries,Behind the Scenes' 'Trailers,Commentaries'
 'Trailers,Behind the Scenes'
 'Commentaries,Deleted Scenes,Behind the Scenes'
 'Trailers,Commentaries,Deleted Scenes'
 'Trailers,Commentaries,Deleted Scenes,Behind the Scenes'
 'Behind the Scenes' 'Commentaries']
language_id [1]

for categorical columns we are much interested in rating and special featureas to predict y (rental_statue), language id will be included but it doesnÂ´t cotain much variety

In [13]:
#Analyze extracted features (X) and transform them
X.describe().T

,count,mean,std,min,25%,50%,75%,max
release_year,1000.0,2006.000,0.000000,2006.0,2006.0,2006.0,2006.00,2006.0
length,1000.0,115.272,40.426332,46.0,80.0,114.0,149.25,185.0
language_id,1000.0,1.000,0.000000,1.0,1.0,1.0,1.00,1.0

In [14]:
# Scale numerical variables
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X[['release_year', 'length']] = scaler.fit_transform(X[['release_year', 'length']])

In [15]:
#encode categorical variables
#Encode categorical variables
X['language_id'] = X['language_id'].astype('category').cat.codes
X['rating'] = X['rating'].astype('category').cat.codes
X['special_features'] = X['special_features'].astype('category').cat.codes

In [16]:
# split train and test /#import logistic regression
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [18]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=100)

# Create a logistic regression model
model = LogisticRegression()

# Fit the model to the training data
model.fit(X_train, y_train)

#

LogisticRegression()

 Evaluate the model

In [20]:
#evaluate model
y_pred = model.predict(X_test)
#check accuracy
accuracy = np.mean(y_pred == y_test)
print('Accuracy:', accuracy)

#check precision
precision = precision_score(y_test, y_pred)
print('Precision:', precision)
# chrck recall
recall = recall_score(y_test, y_pred)
print('Recall:', recall)

#check model score
model.score(X_test, y_test)
print('Model score:', score)

Accuracy: 0.7066666666666667
Precision: 0.7066666666666667
Recall: 1.0
Model score: 0.7066666666666667